MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K90/mcu.h
extern volatile PMD0bits_t PMD0bits __at(0xF19);
// bitfield macros
#define _PMD0_ADCMD_POSN                                    0x0
#define _PMD0_ADCMD_POSITION                                0x0
#define _PMD0_ADCMD_SIZE                                    0x1
#define _PMD0_ADCMD_LENGTH                                  0x1
#define _PMD0_ADCMD_MASK                                    0x1
#define _PMD0_SSP1MD_POSN                                   0x1
#define _PMD0_SSP1MD_POSITION                               0x1
#define _PMD0_SSP1MD_SIZE                                   0x1
#define _PMD0_SSP1MD_LENGTH                                 0x1
#define _PMD0_SSP1MD_MASK                                   0x2
#define _PMD0_SSP2MD_POSN                                   0x2
#define _PMD0_SSP2MD_POSITION                               0x2
#define _PMD0_SSP2MD_SIZE                                   0x1
#define _PMD0_SSP2MD_LENGTH                                 0x1
#define _PMD0_SSP2MD_MASK                                   0x4
#define _PMD0_UART1MD_POSN                                  0x3
#define _PMD0_UART1MD_POSITION                              0x3
#define _PMD0_UART1MD_SIZE                                  0x1
#define _PMD0_UART1MD_LENGTH                                0x1
#define _PMD0_UART1MD_MASK                                  0x8
#define _PMD0_UART2MD_POSN                                  0x4
#define _PMD0_UART2MD_POSITION                              0x4
#define _PMD0_UART2MD_SIZE                                  0x1
#define _PMD0_UART2MD_LENGTH                                0x1
#define _PMD0_UART2MD_MASK                                  0x10
#define _PMD0_CCP1MD_POSN                                   0x5
#define _PMD0_CCP1MD_POSITION                               0x5
#define _PMD0_CCP1MD_SIZE                                   0x1
#define _PMD0_CCP1MD_LENGTH                                 0x1
#define _PMD0_CCP1MD_MASK                                   0x20
#define _PMD0_CCP2MD_POSN                                   0x6
#define _PMD0_CCP2MD_POSITION                               0x6
#define _PMD0_CCP2MD_SIZE                                   0x1
#define _PMD0_CCP2MD_LENGTH                                 0x1
#define _PMD0_CCP2MD_MASK                                   0x40
#define _PMD0_CCP3MD_POSN                                   0x7
#define _PMD0_CCP3MD_POSITION                               0x7
#define _PMD0_CCP3MD_SIZE                                   0x1
#define _PMD0_CCP3MD_LENGTH                                 0x1
#define _PMD0_CCP3MD_MASK                                   0x80
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
extern volatile unsigned char           PSTR3CON            __at(0xF1A);
#ifndef _LIB_BUILD
asm("PSTR3CON equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned STRSYNC                :1;
        unsigned                        :1;
        unsigned CMPL                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned CMPL0                  :1;
        unsigned CMPL1                  :1;
    };
    struct {
        unsigned STRA3                  :1;
        unsigned STRB3                  :1;
        unsigned STRC3                  :1;
        unsigned STRD3                  :1;
        unsigned STRSYNC3               :1;
        unsigned                        :1;
        unsigned CMPL03                 :1;
        unsigned CMPL13                 :1;
    };
} PSTR3CONbits_t;
extern volatile PSTR3CONbits_t PSTR3CONbits __at(0xF1A);
// bitfield macros
#define _PSTR3CON_STRA_POSN                                 0x0
#define _PSTR3CON_STRA_POSITION                             0x0
#define _PSTR3CON_STRA_SIZE                                 0x1
#define _PSTR3CON_STRA_LENGTH                               0x1
#define _PSTR3CON_STRA_MASK                                 0x1
#define _PSTR3CON_STRB_POSN                                 0x1
#define _PSTR3CON_STRB_POSITION                             0x1
#define _PSTR3CON_STRB_SIZE                                 0x1
#define _PSTR3CON_STRB_LENGTH                               0x1
#define _PSTR3CON_STRB_MASK                                 0x2
#define _PSTR3CON_STRC_POSN                                 0x2
#define _PSTR3CON_STRC_POSITION                             0x2
#define _PSTR3CON_STRC_SIZE                                 0x1
#define _PSTR3CON_STRC_LENGTH                               0x1
#define _PSTR3CON_STRC_MASK                                 0x4
#define _PSTR3CON_STRD_POSN                                 0x3
#define _PSTR3CON_STRD_POSITION                             0x3
#define _PSTR3CON_STRD_SIZE                                 0x1
#define _PSTR3CON_STRD_LENGTH                               0x1
#define _PSTR3CON_STRD_MASK                                 0x8
#define _PSTR3CON_STRSYNC_POSN                              0x4
#define _PSTR3CON_STRSYNC_POSITION                          0x4
#define _PSTR3CON_STRSYNC_SIZE                              0x1
#define _PSTR3CON_STRSYNC_LENGTH                            0x1
#define _PSTR3CON_STRSYNC_MASK                              0x10
#define _PSTR3CON_CMPL_POSN                                 0x6
#define _PSTR3CON_CMPL_POSITION                             0x6
#define _PSTR3CON_CMPL_SIZE                                 0x2
#define _PSTR3CON_CMPL_LENGTH                               0x2
#define _PSTR3CON_CMPL_MASK                                 0xC0
#define _PSTR3CON_CMPL0_POSN                                0x6
#define _PSTR3CON_CMPL0_POSITION                            0x6
#define _PSTR3CON_CMPL0_SIZE                                0x1
#define _PSTR3CON_CMPL0_LENGTH                              0x1
#define _PSTR3CON_CMPL0_MASK                                0x40
#define _PSTR3CON_CMPL1_POSN                                0x7
#define _PSTR3CON_CMPL1_POSITION                            0x7
#define _PSTR3CON_CMPL1_SIZE                                0x1
#define _PSTR3CON_CMPL1_LENGTH                              0x1
#define _PSTR3CON_CMPL1_MASK                                0x80
#define _PSTR3CON_STRA3_POSN                                0x0
#define _PSTR3CON_STRA3_POSITION                            0x0
#define _PSTR3CON_STRA3_SIZE                                0x1
#define _PSTR3CON_STRA3_LENGTH                              0x1
#define _PSTR3CON_STRA3_MASK                                0x1
#define _PSTR3CON_STRB3_POSN                                0x1
#define _PSTR3CON_STRB3_POSITION                            0x1
#define _PSTR3CON_STRB3_SIZE                                0x1
#define _PSTR3CON_STRB3_LENGTH                              0x1
#define _PSTR3CON_STRB3_MASK                                0x2
#define _PSTR3CON_STRC3_POSN                                0x2
#define _PSTR3CON_STRC3_POSITION                            0x2
#define _PSTR3CON_STRC3_SIZE                                0x1
#define _PSTR3CON_STRC3_LENGTH                              0x1
#define _PSTR3CON_STRC3_MASK                                0x4
#define _PSTR3CON_STRD3_POSN                                0x3
#define _PSTR3CON_STRD3_POSITION                            0x3
#define _PSTR3CON_STRD3_SIZE                                0x1
#define _PSTR3CON_STRD3_LENGTH                              0x1
#define _PSTR3CON_STRD3_MASK                                0x8
#define _PSTR3CON_STRSYNC3_POSN                             0x4
#define _PSTR3CON_STRSYNC3_POSITION                         0x4
#define _PSTR3CON_STRSYNC3_SIZE                             0x1
#define _PSTR3CON_STRSYNC3_LENGTH                           0x1
#define _PSTR3CON_STRSYNC3_MASK                             0x10
#define _PSTR3CON_CMPL03_POSN                               0x6
#define _PSTR3CON_CMPL03_POSITION                           0x6
#define _PSTR3CON_CMPL03_SIZE                               0x1
#define _PSTR3CON_CMPL03_LENGTH                             0x1
#define _PSTR3CON_CMPL03_MASK                               0x40
#define _PSTR3CON_CMPL13_POSN                               0x7
#define _PSTR3CON_CMPL13_POSITION                           0x7
#define _PSTR3CON_CMPL13_SIZE                               0x1
#define _PSTR3CON_CMPL13_LENGTH                             0x1
#define _PSTR3CON_CMPL13_MASK                               0x80

