MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K90/mcu.h
extern volatile CM2CON1bits_t CM2CON1bits __at(0xF2F);
// bitfield macros
#define _CM2CON1_CCH_POSN                                   0x0
#define _CM2CON1_CCH_POSITION                               0x0
#define _CM2CON1_CCH_SIZE                                   0x2
#define _CM2CON1_CCH_LENGTH                                 0x2
#define _CM2CON1_CCH_MASK                                   0x3
#define _CM2CON1_CREF_POSN                                  0x2
#define _CM2CON1_CREF_POSITION                              0x2
#define _CM2CON1_CREF_SIZE                                  0x1
#define _CM2CON1_CREF_LENGTH                                0x1
#define _CM2CON1_CREF_MASK                                  0x4
#define _CM2CON1_EVPOL_POSN                                 0x3
#define _CM2CON1_EVPOL_POSITION                             0x3
#define _CM2CON1_EVPOL_SIZE                                 0x2
#define _CM2CON1_EVPOL_LENGTH                               0x2
#define _CM2CON1_EVPOL_MASK                                 0x18
#define _CM2CON1_CPOL_POSN                                  0x5
#define _CM2CON1_CPOL_POSITION                              0x5
#define _CM2CON1_CPOL_SIZE                                  0x1
#define _CM2CON1_CPOL_LENGTH                                0x1
#define _CM2CON1_CPOL_MASK                                  0x20
#define _CM2CON1_COE_POSN                                   0x6
#define _CM2CON1_COE_POSITION                               0x6
#define _CM2CON1_COE_SIZE                                   0x1
#define _CM2CON1_COE_LENGTH                                 0x1
#define _CM2CON1_COE_MASK                                   0x40
#define _CM2CON1_CON_POSN                                   0x7
#define _CM2CON1_CON_POSITION                               0x7
#define _CM2CON1_CON_SIZE                                   0x1
#define _CM2CON1_CON_LENGTH                                 0x1
#define _CM2CON1_CON_MASK                                   0x80
#define _CM2CON1_CCH0_POSN                                  0x0
#define _CM2CON1_CCH0_POSITION                              0x0
#define _CM2CON1_CCH0_SIZE                                  0x1
#define _CM2CON1_CCH0_LENGTH                                0x1
#define _CM2CON1_CCH0_MASK                                  0x1
#define _CM2CON1_CCH1_POSN                                  0x1
#define _CM2CON1_CCH1_POSITION                              0x1
#define _CM2CON1_CCH1_SIZE                                  0x1
#define _CM2CON1_CCH1_LENGTH                                0x1
#define _CM2CON1_CCH1_MASK                                  0x2
#define _CM2CON1_EVPOL0_POSN                                0x3
#define _CM2CON1_EVPOL0_POSITION                            0x3
#define _CM2CON1_EVPOL0_SIZE                                0x1
#define _CM2CON1_EVPOL0_LENGTH                              0x1
#define _CM2CON1_EVPOL0_MASK                                0x8
#define _CM2CON1_EVPOL1_POSN                                0x4
#define _CM2CON1_EVPOL1_POSITION                            0x4
#define _CM2CON1_EVPOL1_SIZE                                0x1
#define _CM2CON1_EVPOL1_LENGTH                              0x1
#define _CM2CON1_EVPOL1_MASK                                0x10
#define _CM2CON1_CCH02_POSN                                 0x0
#define _CM2CON1_CCH02_POSITION                             0x0
#define _CM2CON1_CCH02_SIZE                                 0x1
#define _CM2CON1_CCH02_LENGTH                               0x1
#define _CM2CON1_CCH02_MASK                                 0x1
#define _CM2CON1_CCH12_POSN                                 0x1
#define _CM2CON1_CCH12_POSITION                             0x1
#define _CM2CON1_CCH12_SIZE                                 0x1
#define _CM2CON1_CCH12_LENGTH                               0x1
#define _CM2CON1_CCH12_MASK                                 0x2
#define _CM2CON1_CREF2_POSN                                 0x2
#define _CM2CON1_CREF2_POSITION                             0x2
#define _CM2CON1_CREF2_SIZE                                 0x1
#define _CM2CON1_CREF2_LENGTH                               0x1
#define _CM2CON1_CREF2_MASK                                 0x4
#define _CM2CON1_EVPOL02_POSN                               0x3
#define _CM2CON1_EVPOL02_POSITION                           0x3
#define _CM2CON1_EVPOL02_SIZE                               0x1
#define _CM2CON1_EVPOL02_LENGTH                             0x1
#define _CM2CON1_EVPOL02_MASK                               0x8
#define _CM2CON1_EVPOL12_POSN                               0x4
#define _CM2CON1_EVPOL12_POSITION                           0x4
#define _CM2CON1_EVPOL12_SIZE                               0x1
#define _CM2CON1_EVPOL12_LENGTH                             0x1
#define _CM2CON1_EVPOL12_MASK                               0x10
#define _CM2CON1_CPOL2_POSN                                 0x5
#define _CM2CON1_CPOL2_POSITION                             0x5
#define _CM2CON1_CPOL2_SIZE                                 0x1
#define _CM2CON1_CPOL2_LENGTH                               0x1
#define _CM2CON1_CPOL2_MASK                                 0x20
#define _CM2CON1_COE2_POSN                                  0x6
#define _CM2CON1_COE2_POSITION                              0x6
#define _CM2CON1_COE2_SIZE                                  0x1
#define _CM2CON1_COE2_LENGTH                                0x1
#define _CM2CON1_COE2_MASK                                  0x40
#define _CM2CON1_CON2_POSN                                  0x7
#define _CM2CON1_CON2_POSITION                              0x7
#define _CM2CON1_CON2_SIZE                                  0x1
#define _CM2CON1_CON2_LENGTH                                0x1
#define _CM2CON1_CON2_MASK                                  0x80

// Register: T12CON
#define T12CON T12CON
extern volatile unsigned char           T12CON              __at(0xF30);
#ifndef _LIB_BUILD
asm("T12CON equ 0F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T12CKPS                :2;
        unsigned TMR12ON                :1;
        unsigned T12OUTPS               :4;
    };
    struct {
        unsigned T12CKPS0               :1;
        unsigned T12CKPS1               :1;
        unsigned                        :1;
        unsigned T12OUTPS0              :1;
        unsigned T12OUTPS1              :1;
        unsigned T12OUTPS2              :1;
        unsigned T12OUTPS3              :1;
    };
} T12CONbits_t;
extern volatile T12CONbits_t T12CONbits __at(0xF30);
// bitfield macros
#define _T12CON_T12CKPS_POSN                                0x0
#define _T12CON_T12CKPS_POSITION                            0x0
#define _T12CON_T12CKPS_SIZE                                0x2
#define _T12CON_T12CKPS_LENGTH                              0x2
#define _T12CON_T12CKPS_MASK                                0x3
#define _T12CON_TMR12ON_POSN                                0x2
#define _T12CON_TMR12ON_POSITION                            0x2
#define _T12CON_TMR12ON_SIZE                                0x1
#define _T12CON_TMR12ON_LENGTH                              0x1
#define _T12CON_TMR12ON_MASK                                0x4
#define _T12CON_T12OUTPS_POSN                               0x3
#define _T12CON_T12OUTPS_POSITION                           0x3
#define _T12CON_T12OUTPS_SIZE                               0x4
#define _T12CON_T12OUTPS_LENGTH                             0x4
#define _T12CON_T12OUTPS_MASK                               0x78
#define _T12CON_T12CKPS0_POSN                               0x0
#define _T12CON_T12CKPS0_POSITION                           0x0
#define _T12CON_T12CKPS0_SIZE                               0x1
#define _T12CON_T12CKPS0_LENGTH                             0x1
#define _T12CON_T12CKPS0_MASK                               0x1
#define _T12CON_T12CKPS1_POSN                               0x1
#define _T12CON_T12CKPS1_POSITION                           0x1
#define _T12CON_T12CKPS1_SIZE                               0x1
#define _T12CON_T12CKPS1_LENGTH                             0x1
#define _T12CON_T12CKPS1_MASK                               0x2
#define _T12CON_T12OUTPS0_POSN                              0x3
#define _T12CON_T12OUTPS0_POSITION                          0x3
#define _T12CON_T12OUTPS0_SIZE                              0x1
#define _T12CON_T12OUTPS0_LENGTH                            0x1
#define _T12CON_T12OUTPS0_MASK                              0x8
#define _T12CON_T12OUTPS1_POSN                              0x4
#define _T12CON_T12OUTPS1_POSITION                          0x4
#define _T12CON_T12OUTPS1_SIZE                              0x1
#define _T12CON_T12OUTPS1_LENGTH                            0x1
#define _T12CON_T12OUTPS1_MASK                              0x10
#define _T12CON_T12OUTPS2_POSN                              0x5
#define _T12CON_T12OUTPS2_POSITION                          0x5
#define _T12CON_T12OUTPS2_SIZE                              0x1
#define _T12CON_T12OUTPS2_LENGTH                            0x1
#define _T12CON_T12OUTPS2_MASK                              0x20
#define _T12CON_T12OUTPS3_POSN                              0x6
#define _T12CON_T12OUTPS3_POSITION                          0x6
#define _T12CON_T12OUTPS3_SIZE                              0x1
#define _T12CON_T12OUTPS3_LENGTH                            0x1
#define _T12CON_T12OUTPS3_MASK                              0x40

// Register: PR12
#define PR12 PR12
extern volatile unsigned char           PR12                __at(0xF31);
#ifndef _LIB_BUILD
asm("PR12 equ 0F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR12                   :8;
    };
} PR12bits_t;
