MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K90/mcu.h
extern volatile RTCCFGbits_t RTCCFGbits __at(0xF5F);
// bitfield macros
#define _RTCCFG_RTCPTR_POSN                                 0x0
#define _RTCCFG_RTCPTR_POSITION                             0x0
#define _RTCCFG_RTCPTR_SIZE                                 0x2
#define _RTCCFG_RTCPTR_LENGTH                               0x2
#define _RTCCFG_RTCPTR_MASK                                 0x3
#define _RTCCFG_RTCOE_POSN                                  0x2
#define _RTCCFG_RTCOE_POSITION                              0x2
#define _RTCCFG_RTCOE_SIZE                                  0x1
#define _RTCCFG_RTCOE_LENGTH                                0x1
#define _RTCCFG_RTCOE_MASK                                  0x4
#define _RTCCFG_HALFSEC_POSN                                0x3
#define _RTCCFG_HALFSEC_POSITION                            0x3
#define _RTCCFG_HALFSEC_SIZE                                0x1
#define _RTCCFG_HALFSEC_LENGTH                              0x1
#define _RTCCFG_HALFSEC_MASK                                0x8
#define _RTCCFG_RTCSYNC_POSN                                0x4
#define _RTCCFG_RTCSYNC_POSITION                            0x4
#define _RTCCFG_RTCSYNC_SIZE                                0x1
#define _RTCCFG_RTCSYNC_LENGTH                              0x1
#define _RTCCFG_RTCSYNC_MASK                                0x10
#define _RTCCFG_RTCWREN_POSN                                0x5
#define _RTCCFG_RTCWREN_POSITION                            0x5
#define _RTCCFG_RTCWREN_SIZE                                0x1
#define _RTCCFG_RTCWREN_LENGTH                              0x1
#define _RTCCFG_RTCWREN_MASK                                0x20
#define _RTCCFG_RTCEN_POSN                                  0x7
#define _RTCCFG_RTCEN_POSITION                              0x7
#define _RTCCFG_RTCEN_SIZE                                  0x1
#define _RTCCFG_RTCEN_LENGTH                                0x1
#define _RTCCFG_RTCEN_MASK                                  0x80
#define _RTCCFG_RTCPTR0_POSN                                0x0
#define _RTCCFG_RTCPTR0_POSITION                            0x0
#define _RTCCFG_RTCPTR0_SIZE                                0x1
#define _RTCCFG_RTCPTR0_LENGTH                              0x1
#define _RTCCFG_RTCPTR0_MASK                                0x1
#define _RTCCFG_RTCPTR1_POSN                                0x1
#define _RTCCFG_RTCPTR1_POSITION                            0x1
#define _RTCCFG_RTCPTR1_SIZE                                0x1
#define _RTCCFG_RTCPTR1_LENGTH                              0x1
#define _RTCCFG_RTCPTR1_MASK                                0x2

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0xF60);
#ifndef _LIB_BUILD
asm("PIE6 equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1IE                 :1;
        unsigned CMP2IE                 :1;
        unsigned CMP3IE                 :1;
        unsigned                        :1;
        unsigned EEIE                   :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0xF60);
// bitfield macros
#define _PIE6_CMP1IE_POSN                                   0x0
#define _PIE6_CMP1IE_POSITION                               0x0
#define _PIE6_CMP1IE_SIZE                                   0x1
#define _PIE6_CMP1IE_LENGTH                                 0x1
#define _PIE6_CMP1IE_MASK                                   0x1
#define _PIE6_CMP2IE_POSN                                   0x1
#define _PIE6_CMP2IE_POSITION                               0x1
#define _PIE6_CMP2IE_SIZE                                   0x1
#define _PIE6_CMP2IE_LENGTH                                 0x1
#define _PIE6_CMP2IE_MASK                                   0x2
#define _PIE6_CMP3IE_POSN                                   0x2
#define _PIE6_CMP3IE_POSITION                               0x2
#define _PIE6_CMP3IE_SIZE                                   0x1
#define _PIE6_CMP3IE_LENGTH                                 0x1
#define _PIE6_CMP3IE_MASK                                   0x4
#define _PIE6_EEIE_POSN                                     0x4
#define _PIE6_EEIE_POSITION                                 0x4
#define _PIE6_EEIE_SIZE                                     0x1
#define _PIE6_EEIE_LENGTH                                   0x1
#define _PIE6_EEIE_MASK                                     0x10

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0xF61);
#ifndef _LIB_BUILD
asm("EEDATA equ 0F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATA                 :8;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0xF61);
// bitfield macros
#define _EEDATA_EEDATA_POSN                                 0x0
#define _EEDATA_EEDATA_POSITION                             0x0
#define _EEDATA_EEDATA_SIZE                                 0x8
#define _EEDATA_EEDATA_LENGTH                               0x8
#define _EEDATA_EEDATA_MASK                                 0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0xF62);
#ifndef _LIB_BUILD
asm("EEADR equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADR                  :8;
    };
} EEADRbits_t;
extern volatile EEADRbits_t EEADRbits __at(0xF62);
// bitfield macros
#define _EEADR_EEADR_POSN                                   0x0
#define _EEADR_EEADR_POSITION                               0x0
#define _EEADR_EEADR_SIZE                                   0x8
#define _EEADR_EEADR_LENGTH                                 0x8
#define _EEADR_EEADR_MASK                                   0xFF

// Register: EEADRH
#define EEADRH EEADRH
extern volatile unsigned char           EEADRH              __at(0xF63);
#ifndef _LIB_BUILD
asm("EEADRH equ 0F63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRH                 :2;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits __at(0xF63);
// bitfield macros
#define _EEADRH_EEADRH_POSN                                 0x0
#define _EEADRH_EEADRH_POSITION                             0x0
#define _EEADRH_EEADRH_SIZE                                 0x2
#define _EEADRH_EEADRH_LENGTH                               0x2
#define _EEADRH_EEADRH_MASK                                 0x3

// Register: OSCCON2
#define OSCCON2 OSCCON2
extern volatile unsigned char           OSCCON2             __at(0xF64);
#ifndef _LIB_BUILD
asm("OSCCON2 equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MFIOSEL                :1;
        unsigned MFIOFS                 :1;
        unsigned                        :1;
        unsigned SOSCGO                 :1;
        unsigned                        :2;
        unsigned SOSCRUN                :1;
    };
} OSCCON2bits_t;
