MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K90/mcu.h
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0xF6F);
// bitfield macros
#define _LCDDATA9_S24C1_POSN                                0x0
#define _LCDDATA9_S24C1_POSITION                            0x0
#define _LCDDATA9_S24C1_SIZE                                0x1
#define _LCDDATA9_S24C1_LENGTH                              0x1
#define _LCDDATA9_S24C1_MASK                                0x1
#define _LCDDATA9_S25C1_POSN                                0x1
#define _LCDDATA9_S25C1_POSITION                            0x1
#define _LCDDATA9_S25C1_SIZE                                0x1
#define _LCDDATA9_S25C1_LENGTH                              0x1
#define _LCDDATA9_S25C1_MASK                                0x2
#define _LCDDATA9_S26C1_POSN                                0x2
#define _LCDDATA9_S26C1_POSITION                            0x2
#define _LCDDATA9_S26C1_SIZE                                0x1
#define _LCDDATA9_S26C1_LENGTH                              0x1
#define _LCDDATA9_S26C1_MASK                                0x4
#define _LCDDATA9_S27C1_POSN                                0x3
#define _LCDDATA9_S27C1_POSITION                            0x3
#define _LCDDATA9_S27C1_SIZE                                0x1
#define _LCDDATA9_S27C1_LENGTH                              0x1
#define _LCDDATA9_S27C1_MASK                                0x8
#define _LCDDATA9_S28C1_POSN                                0x4
#define _LCDDATA9_S28C1_POSITION                            0x4
#define _LCDDATA9_S28C1_SIZE                                0x1
#define _LCDDATA9_S28C1_LENGTH                              0x1
#define _LCDDATA9_S28C1_MASK                                0x10
#define _LCDDATA9_S29C1_POSN                                0x5
#define _LCDDATA9_S29C1_POSITION                            0x5
#define _LCDDATA9_S29C1_SIZE                                0x1
#define _LCDDATA9_S29C1_LENGTH                              0x1
#define _LCDDATA9_S29C1_MASK                                0x20
#define _LCDDATA9_S30C1_POSN                                0x6
#define _LCDDATA9_S30C1_POSITION                            0x6
#define _LCDDATA9_S30C1_SIZE                                0x1
#define _LCDDATA9_S30C1_LENGTH                              0x1
#define _LCDDATA9_S30C1_MASK                                0x40
#define _LCDDATA9_S31C1_POSN                                0x7
#define _LCDDATA9_S31C1_POSITION                            0x7
#define _LCDDATA9_S31C1_SIZE                                0x1
#define _LCDDATA9_S31C1_LENGTH                              0x1
#define _LCDDATA9_S31C1_MASK                                0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0xF70);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 0F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
} LCDDATA10bits_t;
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0xF70);
// bitfield macros
#define _LCDDATA10_S32C1_POSN                               0x0
#define _LCDDATA10_S32C1_POSITION                           0x0
#define _LCDDATA10_S32C1_SIZE                               0x1
#define _LCDDATA10_S32C1_LENGTH                             0x1
#define _LCDDATA10_S32C1_MASK                               0x1
#define _LCDDATA10_S33C1_POSN                               0x1
#define _LCDDATA10_S33C1_POSITION                           0x1
#define _LCDDATA10_S33C1_SIZE                               0x1
#define _LCDDATA10_S33C1_LENGTH                             0x1
#define _LCDDATA10_S33C1_MASK                               0x2
#define _LCDDATA10_S34C1_POSN                               0x2
#define _LCDDATA10_S34C1_POSITION                           0x2
#define _LCDDATA10_S34C1_SIZE                               0x1
#define _LCDDATA10_S34C1_LENGTH                             0x1
#define _LCDDATA10_S34C1_MASK                               0x4
#define _LCDDATA10_S35C1_POSN                               0x3
#define _LCDDATA10_S35C1_POSITION                           0x3
#define _LCDDATA10_S35C1_SIZE                               0x1
#define _LCDDATA10_S35C1_LENGTH                             0x1
#define _LCDDATA10_S35C1_MASK                               0x8
#define _LCDDATA10_S36C1_POSN                               0x4
#define _LCDDATA10_S36C1_POSITION                           0x4
#define _LCDDATA10_S36C1_SIZE                               0x1
#define _LCDDATA10_S36C1_LENGTH                             0x1
#define _LCDDATA10_S36C1_MASK                               0x10
#define _LCDDATA10_S37C1_POSN                               0x5
#define _LCDDATA10_S37C1_POSITION                           0x5
#define _LCDDATA10_S37C1_SIZE                               0x1
#define _LCDDATA10_S37C1_LENGTH                             0x1
#define _LCDDATA10_S37C1_MASK                               0x20
#define _LCDDATA10_S38C1_POSN                               0x6
#define _LCDDATA10_S38C1_POSITION                           0x6
#define _LCDDATA10_S38C1_SIZE                               0x1
#define _LCDDATA10_S38C1_LENGTH                             0x1
#define _LCDDATA10_S38C1_MASK                               0x40
#define _LCDDATA10_S39C1_POSN                               0x7
#define _LCDDATA10_S39C1_POSITION                           0x7
#define _LCDDATA10_S39C1_SIZE                               0x1
#define _LCDDATA10_S39C1_LENGTH                             0x1
#define _LCDDATA10_S39C1_MASK                               0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0xF71);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 0F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
        unsigned S42C1                  :1;
        unsigned S43C1                  :1;
        unsigned S44C1                  :1;
        unsigned S45C1                  :1;
        unsigned S46C1                  :1;
        unsigned S47C1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK1                 :1;
        unsigned ADMSK2                 :1;
        unsigned ADMSK3                 :1;
        unsigned ADMSK4                 :1;
        unsigned ADMSK5                 :1;
    };
} LCDDATA11bits_t;
