MikroElektronika/core_packages/PIC/XC8/def/PIC18F87K90/mcu.h
extern volatile __bit                   CCP1Y               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit _DEPRECATED       CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE3<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR3,2)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PMD0<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD0,6)
// ODCON1<CCP2OD>
extern volatile __bit                   CCP2OD              __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 CCP2OD_bit          _BIT_ACCESS(ODCON1,6)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTG<CCP3>
extern volatile __bit                   CCP3                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PMD0<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD0,7)
// ODCON2<CCP3OD>
extern volatile __bit                   CCP3OD              __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 CCP3OD_bit          _BIT_ACCESS(ODCON2,0)
// CCP3CON<CCP3X>
extern volatile __bit                   CCP3X               __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 CCP3X_bit           _BIT_ACCESS(CCP3CON,5)
// CCP3CON<CCP3Y>
extern volatile __bit                   CCP3Y               __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 CCP3Y_bit           _BIT_ACCESS(CCP3CON,4)
// PORTG<CCP4>
extern volatile __bit                   CCP4                __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 CCP4_bit            _BIT_ACCESS(PORTG,3)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMD3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD3,1)
// ODCON2<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON2,1)
// CCP4CON<CCP4X>
extern volatile __bit                   CCP4X               __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 CCP4X_bit           _BIT_ACCESS(CCP4CON,5)
// CCP4CON<CCP4Y>
extern volatile __bit                   CCP4Y               __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 CCP4Y_bit           _BIT_ACCESS(CCP4CON,4)
// PORTG<CCP5>
extern volatile __bit                   CCP5                __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 CCP5_bit            _BIT_ACCESS(PORTG,4)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7860);	// @ (0xF0C * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7861);	// @ (0xF0C * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x7862);	// @ (0xF0C * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x7863);	// @ (0xF0C * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMD3<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD3,2)
// ODCON2<CCP5OD>
extern volatile __bit                   CCP5OD              __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 CCP5OD_bit          _BIT_ACCESS(ODCON2,2)
// CCP5CON<CCP5X>
extern volatile __bit                   CCP5X               __at(0x7865);	// @ (0xF0C * 8 + 5)
#define                                 CCP5X_bit           _BIT_ACCESS(CCP5CON,5)
// CCP5CON<CCP5Y>
extern volatile __bit                   CCP5Y               __at(0x7864);	// @ (0xF0C * 8 + 4)
#define                                 CCP5Y_bit           _BIT_ACCESS(CCP5CON,4)
// PORTH<CCP6>
extern volatile __bit _DEPRECATED       CCP6                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 CCP6_bit            _BIT_ACCESS(PORTH,7)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PIE4<CCP6IE>
extern volatile __bit                   CCP6IE              __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 CCP6IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CCP6IF>
extern volatile __bit                   CCP6IF              __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 CCP6IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<CCP6IP>
extern volatile __bit                   CCP6IP              __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 CCP6IP_bit          _BIT_ACCESS(IPR4,3)
// CCP6CON<CCP6M0>
extern volatile __bit                   CCP6M0              __at(0x7848);	// @ (0xF09 * 8 + 0)
#define                                 CCP6M0_bit          _BIT_ACCESS(CCP6CON,0)
// CCP6CON<CCP6M1>
extern volatile __bit                   CCP6M1              __at(0x7849);	// @ (0xF09 * 8 + 1)
#define                                 CCP6M1_bit          _BIT_ACCESS(CCP6CON,1)
// CCP6CON<CCP6M2>
extern volatile __bit                   CCP6M2              __at(0x784A);	// @ (0xF09 * 8 + 2)
#define                                 CCP6M2_bit          _BIT_ACCESS(CCP6CON,2)
// CCP6CON<CCP6M3>
extern volatile __bit                   CCP6M3              __at(0x784B);	// @ (0xF09 * 8 + 3)
#define                                 CCP6M3_bit          _BIT_ACCESS(CCP6CON,3)
// PMD3<CCP6MD>
extern volatile __bit                   CCP6MD              __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 CCP6MD_bit          _BIT_ACCESS(PMD3,3)
// ODCON2<CCP6OD>
extern volatile __bit                   CCP6OD              __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 CCP6OD_bit          _BIT_ACCESS(ODCON2,3)
// CCP6CON<CCP6X>
extern volatile __bit                   CCP6X               __at(0x784D);	// @ (0xF09 * 8 + 5)
#define                                 CCP6X_bit           _BIT_ACCESS(CCP6CON,5)
// CCP6CON<CCP6Y>
extern volatile __bit                   CCP6Y               __at(0x784C);	// @ (0xF09 * 8 + 4)
#define                                 CCP6Y_bit           _BIT_ACCESS(CCP6CON,4)
// PORTH<CCP7>
extern volatile __bit _DEPRECATED       CCP7                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 CCP7_bit            _BIT_ACCESS(PORTH,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PIE4<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CCP7IP>
extern volatile __bit                   CCP7IP              __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 CCP7IP_bit          _BIT_ACCESS(IPR4,4)
// CCP7CON<CCP7M0>
extern volatile __bit                   CCP7M0              __at(0x7830);	// @ (0xF06 * 8 + 0)
#define                                 CCP7M0_bit          _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7M1>
extern volatile __bit                   CCP7M1              __at(0x7831);	// @ (0xF06 * 8 + 1)
#define                                 CCP7M1_bit          _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7M2>
extern volatile __bit                   CCP7M2              __at(0x7832);	// @ (0xF06 * 8 + 2)
#define                                 CCP7M2_bit          _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7M3>
extern volatile __bit                   CCP7M3              __at(0x7833);	// @ (0xF06 * 8 + 3)
#define                                 CCP7M3_bit          _BIT_ACCESS(CCP7CON,3)
// PMD3<CCP7MD>
extern volatile __bit                   CCP7MD              __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 CCP7MD_bit          _BIT_ACCESS(PMD3,4)
// ODCON2<CCP7OD>
extern volatile __bit                   CCP7OD              __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 CCP7OD_bit          _BIT_ACCESS(ODCON2,4)
// CCP7CON<CCP7X>
extern volatile __bit                   CCP7X               __at(0x7835);	// @ (0xF06 * 8 + 5)
#define                                 CCP7X_bit           _BIT_ACCESS(CCP7CON,5)
// CCP7CON<CCP7Y>
extern volatile __bit                   CCP7Y               __at(0x7834);	// @ (0xF06 * 8 + 4)
#define                                 CCP7Y_bit           _BIT_ACCESS(CCP7CON,4)
// PORTH<CCP8>
extern volatile __bit _DEPRECATED       CCP8                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 CCP8_bit            _BIT_ACCESS(PORTH,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PIE4<CCP8IE>
extern volatile __bit                   CCP8IE              __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CCP8IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CCP8IF>
extern volatile __bit                   CCP8IF              __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 CCP8IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CCP8IP>
extern volatile __bit                   CCP8IP              __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 CCP8IP_bit          _BIT_ACCESS(IPR4,5)
// CCP8CON<CCP8M0>
extern volatile __bit                   CCP8M0              __at(0x7A30);	// @ (0xF46 * 8 + 0)
#define                                 CCP8M0_bit          _BIT_ACCESS(CCP8CON,0)
// CCP8CON<CCP8M1>
extern volatile __bit                   CCP8M1              __at(0x7A31);	// @ (0xF46 * 8 + 1)
#define                                 CCP8M1_bit          _BIT_ACCESS(CCP8CON,1)
// CCP8CON<CCP8M2>
extern volatile __bit                   CCP8M2              __at(0x7A32);	// @ (0xF46 * 8 + 2)
#define                                 CCP8M2_bit          _BIT_ACCESS(CCP8CON,2)
// CCP8CON<CCP8M3>
extern volatile __bit                   CCP8M3              __at(0x7A33);	// @ (0xF46 * 8 + 3)
#define                                 CCP8M3_bit          _BIT_ACCESS(CCP8CON,3)
// PMD3<CCP8MD>
extern volatile __bit                   CCP8MD              __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 CCP8MD_bit          _BIT_ACCESS(PMD3,5)
// ODCON2<CCP8OD>
extern volatile __bit                   CCP8OD              __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 CCP8OD_bit          _BIT_ACCESS(ODCON2,5)
// CCP8CON<CCP8X>
extern volatile __bit                   CCP8X               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 CCP8X_bit           _BIT_ACCESS(CCP8CON,5)
// CCP8CON<CCP8Y>
extern volatile __bit                   CCP8Y               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 CCP8Y_bit           _BIT_ACCESS(CCP8CON,4)
// PORTH<CCP9>
extern volatile __bit _DEPRECATED       CCP9                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 CCP9_bit            _BIT_ACCESS(PORTH,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// PIE4<CCP9IE>
extern volatile __bit                   CCP9IE              __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 CCP9IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CCP9IF>
extern volatile __bit                   CCP9IF              __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 CCP9IF_bit          _BIT_ACCESS(PIR4,6)
// IPR4<CCP9IP>
extern volatile __bit                   CCP9IP              __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 CCP9IP_bit          _BIT_ACCESS(IPR4,6)
// CCP9CON<CCP9M0>
extern volatile __bit                   CCP9M0              __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 CCP9M0_bit          _BIT_ACCESS(CCP9CON,0)
// CCP9CON<CCP9M1>
extern volatile __bit                   CCP9M1              __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 CCP9M1_bit          _BIT_ACCESS(CCP9CON,1)
// CCP9CON<CCP9M2>
extern volatile __bit                   CCP9M2              __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 CCP9M2_bit          _BIT_ACCESS(CCP9CON,2)
// CCP9CON<CCP9M3>
extern volatile __bit                   CCP9M3              __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 CCP9M3_bit          _BIT_ACCESS(CCP9CON,3)
// PMD3<CCP9MD>
extern volatile __bit                   CCP9MD              __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 CCP9MD_bit          _BIT_ACCESS(PMD3,6)
// ODCON2<CCP9OD>
extern volatile __bit                   CCP9OD              __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 CCP9OD_bit          _BIT_ACCESS(ODCON2,6)
// CCP9CON<CCP9X>
extern volatile __bit                   CCP9X               __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 CCP9X_bit           _BIT_ACCESS(CCP9CON,5)
// CCP9CON<CCP9Y>
extern volatile __bit                   CCP9Y               __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 CCP9Y_bit           _BIT_ACCESS(CCP9CON,4)
// PORTJ<CE>
extern volatile __bit                   CE                  __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 CE_bit              _BIT_ACCESS(PORTJ,5)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON1<CHSN0>
extern volatile __bit                   CHSN0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 CHSN0_bit           _BIT_ACCESS(ADCON1,0)
// ADCON1<CHSN1>
extern volatile __bit                   CHSN1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 CHSN1_bit           _BIT_ACCESS(ADCON1,1)
// ADCON1<CHSN2>
extern volatile __bit                   CHSN2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 CHSN2_bit           _BIT_ACCESS(ADCON1,2)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// PORTG<CK2>
extern volatile __bit                   CK2                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 CK2_bit             _BIT_ACCESS(PORTG,1)
// SSP1STAT<CKE>
extern volatile __bit _DEPRECATED       CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7806);	// @ (0xF00 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP>
extern volatile __bit _DEPRECATED       CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x77FC);	// @ (0xEFF * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7B2C);	// @ (0xF65 * 8 + 4)
